# TextEditorOptions Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TextEditorOptions Properties
TextEditorOptions Class See Also
---
The TextEditorOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ShowBorder | Show the border box around the text during editing. |
| ShowOpaqueBackground | Show opaque background behind the text during editing. |

# See Also
TextEditorOptions Class
Autodesk.Revit.UI Namespace